In [387]:
#Bismillah
import pandas as pd
#from pandas.api.types import is_string_dtype             # currently not  using it but next time i will use it for sure(for up coming assignment in sha Allah)
from pandas.api.types import is_numeric_dtype

In [388]:
df=pd.read_csv('supershops.csv') #reading the data and uploading

In [389]:
df.head() # showing the 1st five data frame information

   Marketing_Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [390]:
x=df.drop('Profit', axis=1) # droping the Profit column

In [391]:
x.head() # showing the 1st five data frame information without profit column which is concider as 'y'

   Marketing_Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [392]:
y=df['Profit']  # inserting Profit columns value into y object or variable

In [393]:
y.head() #showing the 1st five data frame information of profit column only

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Standard Scaler

In [394]:
from sklearn.preprocessing import StandardScaler # importing StandardScaler method from sklearn class
std = StandardScaler() # taking StandardScaler into an object named 'std'

In [395]:
df_ad=std.fit(df[['Administration']]) # fitting the individual data of administration column

In [396]:
df.Administration=std.transform(df[['Administration']]) # Transforming the individual data of administration column

In [397]:
df.head() # showing the 1st five data frame informaton where the transformation of administration can be found

   Marketing_Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753  471784.10    Dhaka  192261.83
1        162597.70        1.082807  443898.53      Ctg  191792.06
2        153441.51       -0.728257  407934.54  Rangpur  191050.39
3        144372.41       -0.096365  383199.62    Dhaka  182901.99
4        142107.34       -1.079919  366168.42  Rangpur  166187.94

# Assignment Started from here

In [398]:
df_tspt=std.fit(df[['Transport']])# fitting the individual data of Transport column

In [399]:
df.Transport=std.transform(df[['Transport']]) # Transforming the individual data of Transport column

In [400]:
df.head() # showing the 1st five data frame informaton where the transformation of Transport can be found

   Marketing_Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753   2.165287    Dhaka  192261.83
1        162597.70        1.082807   1.929843      Ctg  191792.06
2        153441.51       -0.728257   1.626191  Rangpur  191050.39
3        144372.41       -0.096365   1.417348    Dhaka  182901.99
4        142107.34       -1.079919   1.273550  Rangpur  166187.94

In [401]:
#df.iloc[:,0]=std.fit_transform(df[['Marketing_Spend']]) ,i will more examine on this in sha Allah

df.Marketing_Spend=std.fit_transform(df[['Marketing_Spend']]) # fitting and transforming data at a time

In [402]:
df.head() # showing 1st five data

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Assignment
#Using loop such that i can fit and transform the data at a glance

In [403]:
#Using loop such that i can fit and transform the data at a glance
# Though im using the same loop for Standard Scaler, MinMax Scaler, Max Abs Scaler,Robust Scaler technique respectively
# i would like to explain the code execution once

for col in ['Marketing_Spend','Administration','Transport','Area']:   #col is  a variable here doing loop into the list of column
    if is_numeric_dtype(df[col]) == True:                             #from pandas.api.types importing is_numeric_dtype method to detect the values are  
                                                                      #numeric or not, is_numeric_dtype will give a boolean result, where i have used a condition  
        df[col]=std.fit_transform(df[[col]])                          # if we follow the manual fit and transformation, i have added that operation with loop
    else:                                                             # if there is any string valued column will avoid it according to the condition
        print(f"'{col}' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah ")
        continue                                                      # This attribute let the code run again anad again unless 'col' would go through every list's value

'Area' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah

In [404]:
df.head() # 1st five values

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# MinMax Scaler

In [405]:
from sklearn.preprocessing import MinMaxScaler # importing MinMaxScaler method from sklearn class
mxs= MinMaxScaler()                            # taking MinMaxScaler into an object named 'mxs'

In [406]:
df.Marketing_Spend=mxs.fit_transform(df[['Marketing_Spend']]) # fitting and transforming the data at a time

In [407]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.560753   2.165287    Dhaka  192261.83
1         0.983359        1.082807   1.929843      Ctg  191792.06
2         0.927985       -0.728257   1.626191  Rangpur  191050.39
3         0.873136       -0.096365   1.417348    Dhaka  182901.99
4         0.859438       -1.079919   1.273550  Rangpur  166187.94

In [408]:
df.Administration=mxs.fit_transform(df[['Administration']]) # fitting and transforming the data at a time

In [409]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   2.165287    Dhaka  192261.83
1         0.983359        0.761972   1.929843      Ctg  191792.06
2         0.927985        0.379579   1.626191  Rangpur  191050.39
3         0.873136        0.512998   1.417348    Dhaka  182901.99
4         0.859438        0.305328   1.273550  Rangpur  166187.94

In [410]:
df.Transport=mxs.fit_transform(df[['Transport']]) # fitting and transforming the data at a time

In [411]:
df.head()  # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Assignment
#Using loop such that i can fit and transform the data at a glance

In [412]:
#please follow the above loop of Standard Scaler,the code execution also same here
for col in ['Marketing_Spend','Administration','Transport','Area']: 
    if is_numeric_dtype(df[col]) == True:
        df[col]=mxs.fit_transform(df[[col]])
    else:
        print(f"'{col}' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah ")
        continue

'Area' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah

In [413]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Max Abs Scaler

In [414]:
from sklearn.preprocessing import MaxAbsScaler          #importing MaxAbsScaler method from sklearn class
mas=MaxAbsScaler()                                      #taking MaxAbsScaler into an object named 'mas'

In [415]:
df.Marketing_Spend=mas.fit_transform(df[['Marketing_Spend']]) # fitting and transforming the data at a time

In [416]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

In [417]:
df.Administration=mas.fit_transform(df[['Administration']]) # fitting and transforming the data at a time

In [418]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

In [419]:
df.Transport=mas.fit_transform(df[['Transport']]) # fitting and transforming the data at a time

In [420]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Assignment
#Using loop such that i can fit and transform the data at a glance

In [421]:
#please follow the above loop of Standard Scaler,the code execution also same here

for col in ['Marketing_Spend','Administration','Transport','Area']: 
    if is_numeric_dtype(df[col]) == True:
        df[col]=mas.fit_transform(df[[col]])
    else:
        print(f"'{col}' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah ")
        continue

'Area' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah

In [422]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Robust Scaler

In [423]:
from sklearn.preprocessing import RobustScaler          #importing RobustScaler method from sklearn class
rbts= RobustScaler()                                    #taking RobustScaler into an object named 'rbts'

In [424]:
df.Marketing_Spend=rbts.fit_transform(df[['Marketing_Spend']]) # fitting and transforming the data at a time

In [425]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.672530        0.651744   1.000000    Dhaka  192261.83
1         1.452113        0.761972   0.940893      Ctg  191792.06
2         1.303634        0.379579   0.864664  Rangpur  191050.39
3         1.156567        0.512998   0.812235    Dhaka  182901.99
4         1.119836        0.305328   0.776136  Rangpur  166187.94

In [426]:
df.Administration=rbts.fit_transform(df[['Administration']])

In [427]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.000000    Dhaka  192261.83
1         1.452113        0.697565   0.940893      Ctg  191792.06
2         1.303634       -0.524290   0.864664  Rangpur  191050.39
3         1.156567       -0.097977   0.812235    Dhaka  182901.99
4         1.119836       -0.761543   0.776136  Rangpur  166187.94

In [428]:
df.Transport=rbts.fit_transform(df[['Transport']]) # fitting and transforming the data at a time

In [429]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# Assignment
#Using loop such that i can fit and transform the data at a glance

In [430]:
#please follow the above loop of Standard Scaler,the code execution also same here

for col in ['Marketing_Spend','Administration','Transport','Area']: 
    if is_numeric_dtype(df[col]) == True:
        df[col]=rbts.fit_transform(df[[col]])
    else:
        print(f"'{col}' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah ")
        continue

'Area' from the data frame has string values so we are avoiding this to transform its data, we will work on it later             in sha Allah

In [431]:
df.head() # 1st five data frame data is representing here

   Marketing_Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

In [432]:
print("Alhamdulillah")

Alhamdulillah